[
  {
    "id": 1,
    "segment_name": "Single-family homes",
    "estate_title": "Cozy Family Retreat",
    "description": "Discover the perfect blend of comfort and style in this cozy single-family home. Nestled in a serene neighborhood, this charming residence offers a peaceful retreat from the hustle and bustle of city life. With spacious interiors and modern amenities, this home is ideal for families looking to create lasting memories. Relax in the inviting living room, prepare delicious meals in the gourmet kitchen, or unwind in the private backyard oasis. Conveniently located near schools, parks, and shopping centers, this home offers the perfect combination of convenience and tranquility.",
    "price": "$400,000",
    "status": "sale",
    "area": "2000 sq ft",
    "location": "Suburban Paradise",
    "facilities": ["Backyard", "Gourmet Kitchen", "Spacious Living Areas"],
    "img_url": "https://i.ibb.co/1GNxCsM/house-1836070.jpg",
    "year_built": 2005,
    "floor_level": 1,
    "monthly_fee": "$200"
  },
  {
    "id": 2,
    "segment_name": "Townhouses",
    "estate_title": "Urban Townhouse Retreat",
    "description": "Experience urban living at its finest in this modern townhouse retreat. Located in the heart of the city, this stylish residence offers the perfect combination of luxury and convenience. With sleek design elements and high-end finishes, this townhouse exudes sophistication. Entertain guests in the open-concept living area, cook gourmet meals in the chef's kitchen, or relax on the rooftop terrace with stunning city views. Close to trendy restaurants, boutique shops, and cultural attractions, this townhouse offers the ultimate urban lifestyle.",
    "price": "$600,000",
    "status": "sale",
    "area": "2500 sq ft",
    "location": "Downtown Hub",
    "facilities": ["Rooftop Terrace", "Chef's Kitchen", "Open-Concept Design"],
    "img_url": "https://i.ibb.co/kJW3kC0/townhouse-1026380.jpg",
    "year_built": 2010,
    "floor_level": 2,
    "monthly_fee": "$300"
  },
  {
    "id": 3,
    "segment_name": "Apartments",
    "estate_title": "Luxury Urban Apartment",
    "description": "Live in luxury in this urban apartment oasis. Situated in a vibrant neighborhood, this spacious apartment offers modern amenities and panoramic city views. With floor-to-ceiling windows and contemporary design features, this apartment is perfect for those seeking a cosmopolitan lifestyle. Relax in the resort-style pool, work out in the state-of-the-art fitness center, or entertain guests in the stylish lounge area. Close to downtown attractions, dining hotspots, and cultural venues, this apartment offers the ultimate in urban living.",
    "price": "$800,000",
    "status": "sale",
    "area": "1500 sq ft",
    "location": "City Center",
    "facilities": ["Resort-style Pool", "Fitness Center", "Stylish Lounge"],
    "img_url": "https://i.ibb.co/XDVyQXb/apartments-1845884.jpg",
    "year_built": 2015,
    "floor_level": 5,
    "monthly_fee": "$400"
  },
  {
    "id": 4,
    "segment_name": "Student housing",
    "estate_title": "Modern Student Residence",
    "description": "Discover the perfect student residence in this modern and stylish apartment complex. Located near the university campus, this residence offers convenience and comfort for students. With spacious bedrooms, study areas, and communal spaces, this residence provides a supportive environment for academic success. Enjoy amenities such as a fitness center, study lounges, and social events organized by the resident community. Close to campus facilities, dining options, and public transportation, this residence is the ideal choice for student living.",
    "price": "$1,200/month",
    "status": "rent",
    "area": "800 sq ft",
    "location": "University Campus",
    "facilities": ["Fitness Center", "Study Lounges", "Social Events"],
    "img_url": "https://i.ibb.co/NZCYwKz/dresden-986127.jpg",
    "year_built": 2018,
    "floor_level": 3,
    "monthly_fee": "$150"
  },
  {
    "id": 5,
    "segment_name": "Senior living communities",
    "estate_title": "Retirement Haven",
    "description": "Experience retirement living at its finest in this exclusive senior community. Nestled in a picturesque setting, this community offers resort-style amenities and personalized care for residents. With spacious residences, gourmet dining, and a full calendar of activities, this community provides a vibrant and active lifestyle for retirees. Enjoy amenities such as a clubhouse, fitness center, and walking trails surrounded by natural beauty. With a focus on wellness and social engagement, this community offers a fulfilling and enriching retirement experience.",
    "price": "$500,000",
    "status": "sale",
    "area": "1800 sq ft",
    "location": "Senior Haven",
    "facilities": ["Clubhouse", "Fitness Center", "Walking Trails"],
    "img_url": "https://i.ibb.co/Wcc0cdJ/leisure-2659619.jpg",
    "year_built": 2000,
    "floor_level": 1,
    "monthly_fee": "$200"
  },
  {
    "id": 6,
    "segment_name": "Vacation rentals",
    "estate_title": "Seaside Escape",
    "description": "Escape to paradise in this luxurious beachfront villa available for vacation rentals. Situated on a pristine stretch of coastline, this stunning villa offers the ultimate retreat for discerning travelers. With a total area of 3500 square feet, this spacious villa features 5 bedrooms, 4 bathrooms, and ample living space for up to 10 guests. The interior is elegantly furnished with contemporary decor and high-end finishes, creating a serene and inviting atmosphere. Step outside to your private oasis, where you'll find a sparkling infinity pool, expansive sundeck, and lush tropical gardens. Enjoy direct access to the beach, where you can swim, snorkel, or simply relax and soak up the sun. With personalized concierge services available, your every need will be taken care of during your stay in this exclusive beachfront retreat.",
    "price": "$1,500/night",
    "status": "rent",
    "area": "3500 sq ft",
    "location": "Beachfront Bliss",
    "facilities": ["Private Pool", "Outdoor Kitchen", "Direct Beach Access"],
    "img_url": "https://i.ibb.co/pnRY75f/holiday-home-1522051.jpg",
    "year_built": 2012,
    "floor_level": 1,
    "monthly_fee": "$0"
  },
  {
    "id": 7,
    "segment_name": "Luxury",
    "estate_title": "Urban Penthouse Paradise",
    "description": "Indulge in the height of luxury living in this exquisite penthouse with panoramic views of the city skyline. Perched atop a prestigious high-rise building, this opulent residence offers unparalleled elegance and sophistication. Spanning 4000 square feet, this expansive penthouse features 4 bedrooms, 5 bathrooms, and multiple living areas designed for both relaxation and entertainment. Enjoy breathtaking views from the floor-to-ceiling windows, host lavish parties in the spacious living and dining areas, or unwind on the private terrace overlooking the city. With top-of-the-line amenities and impeccable attention to detail, this penthouse redefines urban luxury living.",
    "price": "$2,500,000",
    "status": "sale",
    "area": "4000 sq ft",
    "location": "Downtown Skyline",
    "facilities": ["Floor-to-Ceiling Windows", "Private Terrace", "High-End Finishes"],
    "img_url": "https://i.ibb.co/hR55qyk/house-1477041-1920.jpg",
    "year_built": 2016,
    "floor_level": 30,
    "monthly_fee": "$0"
  },
  {
    "id": 8,
    "segment_name": "Luxury",
    "estate_title": "Mansion on the Hill",
    "description": "Live like royalty in this grand mansion nestled atop a scenic hillside. With commanding views of the surrounding landscape, this palatial estate offers unparalleled privacy and luxury. Spanning over 10,000 square feet, this magnificent residence features 7 bedrooms, 10 bathrooms, and multiple living areas spread across three levels. Immerse yourself in the opulent surroundings, from the grand foyer with its sweeping staircase to the luxurious master suite with its own private balcony. Entertain guests in the elegant formal dining room, relax in the cozy library, or host outdoor gatherings in the sprawling gardens. With every imaginable amenity and exquisite craftsmanship throughout, this mansion is truly a masterpiece of luxury living.",
    "price": "$5,000,000",
    "status": "sale",
    "area": "10000 sq ft",
    "location": "Hilltop Haven",
    "facilities": ["Grand Foyer", "Private Balcony", "Sprawling Gardens"],
    "img_url": "https://i.ibb.co/X47zHt9/large-home-389271-1920.jpg",
    "year_built": 2008,
    "floor_level": 3,
    "monthly_fee": "$0"
  },
  {
    "id": 9,
    "segment_name": "Luxury",
    "estate_title": "Elegant Waterfront Villa",
    "description": "Experience waterfront living at its finest in this elegant villa nestled along the shores of a tranquil bay. With sweeping views of the water and lush tropical landscaping, this exclusive retreat offers the ultimate in luxury and privacy. The sprawling estate boasts over 8000 square feet of living space, including 5 bedrooms, 7 bathrooms, and multiple indoor and outdoor entertainment areas. Relax in the infinity-edge pool overlooking the bay, dine alfresco on the expansive terrace, or take in the sunset from your private dock. With world-class amenities and meticulous attention to detail, this waterfront villa is a true masterpiece of coastal living.",
    "price": "$3,800,000",
    "status": "sale",
    "area": "8000 sq ft",
    "location": "Waterfront Bay",
    "facilities": ["Infinity-Edge Pool", "Expansive Terrace", "Private Dock"],
    "img_url": "https://i.ibb.co/yYCXThW/real-estate-8636239.jpg",
    "year_built": 2014,
    "floor_level": 1,
    "monthly_fee": "$0"
  }
]

